PayPalAPISoapBinding.CreateMobilePayment.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="urn:ebay:apis:CoreComponentTypes"
    xmlns:ns4="urn:ebay:apis:EnhancedDataTypes"
    xmlns:ns3="urn:ebay:apis:eBLBaseComponents"
    xmlns:ns1="urn:ebay:api:PayPalAPI">
 <SOAP-ENV:Header>
  <ns1:RequesterCredentials>
   <ns3:eBayAuthToken></ns3:eBayAuthToken>
   <ns3:HardExpirationWarning></ns3:HardExpirationWarning>
   <ns3:Credentials>
    <ns3:AppId></ns3:AppId>
    <ns3:DevId></ns3:DevId>
    <ns3:AuthCert></ns3:AuthCert>
    <ns3:Username></ns3:Username>
    <ns3:Password></ns3:Password>
    <ns3:Signature></ns3:Signature>
    <ns3:Subject></ns3:Subject>
    <ns3:AuthToken></ns3:AuthToken>
   </ns3:Credentials>
  </ns1:RequesterCredentials>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns1:CreateMobilePaymentReq>
    <ns1:CreateMobilePaymentRequest>
     <ns3:CreateMobilePaymentRequestDetails>
      <ns3:PaymentType>P2P</ns3:PaymentType>
      <ns3:PaymentAction>None</ns3:PaymentAction>
      <ns3:SenderPhone>
       <ns3:CountryCode></ns3:CountryCode>
       <ns3:PhoneNumber></ns3:PhoneNumber>
       <ns3:Extension></ns3:Extension>
      </ns3:SenderPhone>
      <ns3:RecipientType>PhoneNumber</ns3:RecipientType>
      <ns3:RecipientEmail></ns3:RecipientEmail>
      <ns3:RecipientPhone>
       <ns3:CountryCode></ns3:CountryCode>
       <ns3:PhoneNumber></ns3:PhoneNumber>
       <ns3:Extension></ns3:Extension>
      </ns3:RecipientPhone>
      <ns3:ItemAmount currencyID="AFA"></ns3:ItemAmount>
      <ns3:Tax currencyID="AFA"></ns3:Tax>
      <ns3:Shipping currencyID="AFA"></ns3:Shipping>
      <ns3:ItemName></ns3:ItemName>
      <ns3:ItemNumber></ns3:ItemNumber>
      <ns3:Note></ns3:Note>
      <ns3:CustomID></ns3:CustomID>
      <ns3:SharePhoneNumber>0</ns3:SharePhoneNumber>
      <ns3:ShareHomeAddress>0</ns3:ShareHomeAddress>
     </ns3:CreateMobilePaymentRequestDetails>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:DetailLevel>ReturnAll</ns1:DetailLevel>
     <ns1:ErrorLanguage></ns1:ErrorLanguage>
     <ns1:Version></ns1:Version>
     <!-- extensibility element(s) -->
    </ns1:CreateMobilePaymentRequest>
   </ns1:CreateMobilePaymentReq>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
